Autodesk.Revit.DB.Architecture.Room.IsPointInRoom(Autodesk.Revit.DB.XYZ)
Determines if a point lies within the volume of the room.
point: Point to be checked.
Returns true if the point is in the room, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the point is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The coordinates of the point is not a number.

Autodesk.Revit.DB.Architecture.Room.Unplace
Remove the room from its location, but the project still contains the room.
The room can be placed in another location after unplaced.
Remarks:
Note that current room is changed to unplaced and all corresponding rooms which in other group instance are deleted
when in group edit mode.

Autodesk.Revit.DB.Architecture.Room.Volume
Get the Volume of the Room.
Remarks: This property is used to get the Volume of the Room.

Autodesk.Revit.DB.Architecture.Room.UnboundedHeight
Get the Unbounded Height of the Room.
Remarks: This property is used to get the Unbounded Height of the Room.

Autodesk.Revit.DB.Architecture.Room.BaseOffset
Get or Set the Base Offset of the Room.
Remarks: This property is used to get or set the Base Offset of the Room.

Autodesk.Revit.DB.Architecture.Room.LimitOffset
Get or Set the Limit Offset of the Room.
Remarks: This property is used to get or set the Limit Offset of the Room.

Autodesk.Revit.DB.Architecture.Room.UpperLimit
Get or Set the Upper Limit of the Room.
Remarks: This property is used to get or set the Upper Limit of the Room.

Autodesk.Revit.DB.Architecture.Room.ClosedShell
Return the closedShell of the Room.

Autodesk.Revit.DB.Architecture.Room
Provides access to the room topology in Autodesk Revit.
Remarks: The room object can be queried for its boundary for use in space planning tools.